<%@page contentType="text/html; charset=utf-8" language="java"%>
<html>
	<head>
	</head>
	<body>
		作为一名职业顾问，我不时看到即将到临的职场悲剧。它是这样一步步发生的：

程序员无法见到用户。
程序员从项目经理那里接任务，项目经理一个人跟用户打交道。程序员把项目报告给项目经理，却从未被邀请参加公司级别的工作会议。

项目经理不能向程序员全面地描述市场需求。
也许客户再三对数据库的糟糕性能表示不满，但项目经理没明确地把这些不满告诉程序员。程序员按部就班地工作，全然不知用户多么地生气。

程序员把精力放在不重要的事务上。
程序员为了一项关乎公司存亡的项目埋头工作，然而项目本身却跟用户脱钩了。譬如，程序员正花时间将某个程序从X版本升级到Y版本，仅仅因为厂家马上要放弃支持版本X了。版本升级本身没错，问题是用户并没有相关的需求，用户更关心的是性能。

项目经理常常解雇程序员。
每隔一两年，项目经理就会解雇某个表现不佳的程序员。然后招一个新人来顶替原来的位置。开始一两年，新人的表现很好，时间久了后，一旦他们犯下错误，项目出了问题，项目经理就开始炒人了。

项目经理通过猎头招人。
项目经理已将朋友和旧同事都得罪光了，再也没人愿意跟他一起工作。他只能靠猎头来招人。

而那个新程序员很快就会被项目经理炒掉。
如果那个人是你，你有两个选择：赶紧找个新工作，或想办法影响项目经理从而使项目正常进行。你没办法让他被炒鱿鱼，但你只需要几分钟的时间就可以剥夺他的权力——直接找用户谈。他们是否满意软件的性能？IT架构用起来有何困难？聆听客户的需求，实实在在的提升软件性能，跟客户保持联系。

你需要动动脑子，因为项目经理很可能是客户与程序员们之间的唯一桥梁，既讨好客户又不得罪项目经理需要一些政治手腕，但并不是做不到。不幸的是，总会有人会被炒掉，但至少那个人不是你。而如果你真诚对待你的同事，并把这些技巧教给他们，项目经理会变得越来越无关紧要。
	</body>
</html>
